Config/Reports/PhoneCalls.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Report>
		<Properties>
			<Name>PhoneCalls</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Hotel</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Hotels</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>PeriodFrom</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>PeriodTo</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>PhoneCallType</Name>
					<Type>
						<v8:Type>cfg:EnumRef.PhoneCallTypes</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>PhoneNumber</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.PhoneNumbers</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Room</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Rooms</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Report</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Reports</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ReportBuilder</Name>
					<Type>
						<v8:Type>cfg:ReportBuilder</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>QueryText</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ReportAppearanceTemplateType</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ReportAppearanceTemplateTypes</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ReportDimensionsPlacementOnRowsType</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ReportDimensionsPlacementTypes</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ReportDimensionsPlacementOnColumnsType</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ReportDimensionsPlacementTypes</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ReportTotalsPlacementOnRowsType</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ReportTotalsPlacementTypes</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ReportTotalsPlacementOnColumnsType</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ReportTotalsPlacementTypes</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ReportDimensionAttributesPlacementInRowsType</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ReportDimensionAttributesPlacementTypes</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ReportDimensionAttributesPlacementInColumnsType</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ReportDimensionAttributesPlacementTypes</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ReportAutoscaleType</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ReportAutoscaleTypes</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ReportPageOrientation</Name>
					<Type>
						<v8:Type>cfg:EnumRef.PageOrientations</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ReportDoNotPutReportHeader</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ReportDoNotPutTableHeader</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ReportDoNotPutDetailRecords</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ReportDoNotPutTableFooter</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ReportDoNotPutOveralls</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ReportDoNotPutReportFooter</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ReportColumnOverrides</Name>
					<Type>
						<v8:Type>v8:ValueTable</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Report>
</MetaDataObject>

Config/AccumulationRegisters/PhoneCalls.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>PhoneCalls</Name>
			<RegisterType>Turnovers</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Sum</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>17</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>PerCallSum</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>17</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Quantity</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>7</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>PhoneCallDate</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>TargetPhoneNumber</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Remarks</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Price</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>17</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>PhoneCallPriceIsWithVAT</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Unit</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>VATRate</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.VATRates</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>VATSum</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>17</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Folio</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Folio</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Charge</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Charge</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>PerCallService</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Services</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>PerCallServiceVATRate</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.VATRates</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>PerCallVATSum</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>17</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>PerCallCharge</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Charge</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ExchangeRateDate</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>CurrencyExchangeRate</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>7</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Author</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Employees</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>PhoneNumber</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.PhoneNumbers</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Room</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Rooms</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>PhoneCallType</Name>
					<Type>
						<v8:Type>cfg:EnumRef.PhoneCallTypes</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>PhoneCallRegion</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>PhoneCallService</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Services</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Company</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Companies</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Hotel</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Hotels</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Currency</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Currencies</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Config/Reports/PhoneCalls/Ext/ObjectModule.bsl
// -----------------------------------------------------------------------------
// Reports framework start
// -----------------------------------------------------------------------------

// -----------------------------------------------------------------------------
Procedure pmSaveReportAttributes(pGenerateOnly = False) Export
	cmSaveReportAttributes(ThisObject, , pGenerateOnly);
EndProcedure // pmSaveReportAttributes

// -----------------------------------------------------------------------------
Procedure pmLoadReportAttributes(pParameter = Undefined) Export
	cmLoadReportAttributes(ThisObject, pParameter);
EndProcedure // pmLoadReportAttributes

// -----------------------------------------------------------------------------
// Initialize attributes with default values
// Attention: This procedure could be called AFTER some attributes initialization
// routine, so it SHOULD NOT reset attributes being set before
// -----------------------------------------------------------------------------
Procedure pmFillAttributesWithDefaultValues() Export
	// Fill parameters with default values
	If Not ValueIsFilled(Hotel) Then
		Hotel = SessionParameters.CurrentHotel;
	EndIf;
	If Not ValueIsFilled(PeriodFrom) Then
		PeriodFrom = BegOfDay(CurrentSessionDate()); // For today
		PeriodTo = EndOfDay(PeriodFrom);
	EndIf;
EndProcedure // pmFillAttributesWithDefaultValues

// -----------------------------------------------------------------------------
Function pmGetReportParametersPresentation() Export
	vParamPresentation = "";
	If Not ValueIsFilled(PeriodFrom) And Not ValueIsFilled(PeriodTo) Then
		vParamPresentation = vParamPresentation + NStr("en='Report period is not set';ru='Период отчета не установлен';de='Berichtszeitraum nicht festgelegt'") + 
		                     ";" + Chars.LF;
	ElsIf ValueIsFilled(PeriodFrom) And Not ValueIsFilled(PeriodTo) Then
		vParamPresentation = vParamPresentation + NStr("ru = 'Период c '; en = 'Period from '; de = 'Periode von '") + 
		                     Format(PeriodFrom, "DF='dd.MM.yyyy HH:mm'") + 
		                     ";" + Chars.LF;
	ElsIf Not ValueIsFilled(PeriodFrom) And ValueIsFilled(PeriodTo) Then
		vParamPresentation = vParamPresentation + NStr("ru = 'Период по '; en = 'Period to '; de = 'Periode zu '") + 
		                     Format(PeriodTo, "DF='dd.MM.yyyy HH:mm'") + 
		                     ";" + Chars.LF;
	ElsIf PeriodFrom = PeriodTo Then
		vParamPresentation = vParamPresentation + NStr("ru = 'Период на '; en = 'Period on '; de = 'Periode '") + 
		                     Format(PeriodFrom, "DF='dd.MM.yyyy HH:mm'") + 
		                     ";" + Chars.LF;
	ElsIf PeriodFrom < PeriodTo Then
		vParamPresentation = vParamPresentation + NStr("ru = 'Период '; en = 'Period '; de = 'Periode '") + PeriodPresentation(PeriodFrom, PeriodTo, cmLocalizationCode()) + 
		                     ";" + Chars.LF;
	Else
		vParamPresentation = vParamPresentation + NStr("en='Period is wrong!';ru='Неправильно задан период!';de='Der Zeitraum wurde falsch eingetragen!'") + 
		                     ";" + Chars.LF;
	EndIf;
	If ValueIsFilled(PhoneCallType) Then
		vParamPresentation = vParamPresentation + NStr("ru = 'Тип телефонного разговора '; en = 'Phone call type '; de = 'Telefon Anruf Typ '") + 
							 TrimAll(PhoneCallType) + 
							 ";" + Chars.LF;
	EndIf;					 
	If ValueIsFilled(PhoneNumber) Then
		If Not PhoneNumber.IsFolder Then
			vParamPresentation = vParamPresentation + NStr("ru = 'Телефонный номер '; en = 'Phone number '; de = 'Telefonnummer '") + 
			                     TrimAll(PhoneNumber.Description) + 
			                     ";" + Chars.LF;
		Else
			vParamPresentation = vParamPresentation + NStr("ru = 'Группа телефонных номеров '; en = 'Phone numbers folder '; de = 'Telefonnummergruppe '") + 
			                     TrimAll(PhoneNumber.Description) + 
			                     ";" + Chars.LF;
		EndIf;
	EndIf;							 
	If ValueIsFilled(Room) Then
		If Not Room.IsFolder Then
			vParamPresentation = vParamPresentation + NStr("en='Room ';ru='Номер ';de='Zimmer '") + 
			                     TrimAll(Room.Description) + 
			                     ";" + Chars.LF;
		Else
			vParamPresentation = vParamPresentation + NStr("en='Rooms folder ';ru='Группа номеров ';de='Zimmergruppe '") + 
			                     TrimAll(Room.Description) + 
			                     ";" + Chars.LF;
		EndIf;
	EndIf;							 
	If ValueIsFilled(Hotel) Then
		If Not Hotel.IsFolder Then
			vParamPresentation = vParamPresentation + NStr("en='Hotel ';ru='Гостиница ';de='Hotel '") + 
			                     Hotel.GetObject().pmGetHotelPrintName(SessionParameters.CurrentLanguage) + 
			                     ";" + Chars.LF;
		Else
			vParamPresentation = vParamPresentation + NStr("en='Hotels folder ';ru='Группа гостиниц ';de='Hotelgruppe '") + 
			                     Hotel.GetObject().pmGetHotelPrintName(SessionParameters.CurrentLanguage) + 
			                     ";" + Chars.LF;
		EndIf;
	EndIf;
	Return vParamPresentation;
EndFunction // pmGetReportParametersPresentation

// -----------------------------------------------------------------------------
// Runs report
// -----------------------------------------------------------------------------
Procedure pmGenerate(pSpreadsheet) Export
	Var vTemplateAttributes;
	
	// Reset report builder template
	ReportBuilder.Template = Undefined;
	
	// Initialize report builder query generator attributes
	ReportBuilder.PresentationAdding = PresentationAdditionType.Add;
	
	// Fill report parameters
	ReportBuilder.Parameters.Insert("qHotel", Hotel);
	ReportBuilder.Parameters.Insert("qHotelIsEmpty", Not ValueIsFilled(Hotel));
	ReportBuilder.Parameters.Insert("qPeriodFrom", PeriodFrom);
	ReportBuilder.Parameters.Insert("qPeriodTo", PeriodTo);
	ReportBuilder.Parameters.Insert("qPhoneCallType", PhoneCallType);
	ReportBuilder.Parameters.Insert("qPhoneCallTypeIsEmpty", Not ValueIsFilled(PhoneCallType));
	ReportBuilder.Parameters.Insert("qPhoneNumber", PhoneNumber);
	ReportBuilder.Parameters.Insert("qPhoneNumberIsEmpty", Not ValueIsFilled(PhoneNumber));
	ReportBuilder.Parameters.Insert("qRoom", Room);
	ReportBuilder.Parameters.Insert("qRoomIsEmpty", Not ValueIsFilled(Room));
	
	// Execute report builder query
	ReportBuilder.Execute();
	
	// Apply appearance settings to the report template
	vTemplateAttributes = cmApplyReportTemplateAppearance(ThisObject);
	
	// Output report to the spreadsheet
	ReportBuilder.Put(pSpreadsheet);
	//ReportBuilder.Template.Show(); // For debug purpose

	// Apply appearance settings to the report spreadsheet
	cmApplyReportAppearance(ThisObject, pSpreadsheet, vTemplateAttributes);
EndProcedure // pmGenerate
	
// -----------------------------------------------------------------------------
Procedure pmInitializeReportBuilder() Export
	ReportBuilder = New ReportBuilder();
	
	// Initialize default query text
	QueryText = 
	"SELECT
	|	PhoneCalls.Period,
	|	PhoneCalls.PhoneCallDate AS PhoneCallDate,
	|	PhoneCalls.PhoneCallType,
	|	PhoneCalls.PhoneNumber,
	|	PhoneCalls.Room,
	|	PhoneCalls.Quantity AS Quantity,
	|	PhoneCalls.Price,
	|	PhoneCalls.Currency,
	|	PhoneCalls.Sum AS Sum,
	|	PhoneCalls.PerCallSum AS PerCallSum,
	|	PhoneCalls.TargetPhoneNumber,
	|	PhoneCalls.PhoneCallRegion,
	|	PhoneCalls.Remarks,
	|	PhoneCalls.Folio
	|{SELECT
	|	Period,
	|	(HOUR(PhoneCalls.Period)) AS AccountingHour,
	|	(BEGINOFPERIOD(PhoneCalls.Period, DAY)) AS AccountingDate,
	|	(WEEK(PhoneCalls.Period)) AS AccountingWeek,
	|	(MONTH(PhoneCalls.Period)) AS AccountingMonth,
	|	(QUARTER(PhoneCalls.Period)) AS AccountingQuarter,
	|	(YEAR(PhoneCalls.Period)) AS AccountingYear,
	|	PhoneCalls.Recorder.*,
	|	PhoneCallDate,
	|	(HOUR(PhoneCalls.PhoneCallDate)) AS CallHour,
	|	(BEGINOFPERIOD(PhoneCalls.PhoneCallDate, DAY)) AS CallDate,
	|	(WEEK(PhoneCalls.PhoneCallDate)) AS CallWeek,
	|	(MONTH(PhoneCalls.PhoneCallDate)) AS CallMonth,
	|	(QUARTER(PhoneCalls.PhoneCallDate)) AS CallQuarter,
	|	(YEAR(PhoneCalls.PhoneCallDate)) AS CallYear,
	|	PhoneCallType.*,
	|	PhoneNumber.*,
	|	Room.*,
	|	Quantity,
	|	Price,
	|	Currency.*,
	|	Sum,
	|	PerCallSum,
	|	TargetPhoneNumber,
	|	PhoneCallRegion,
	|	Remarks,
	|	Folio.*,
	|	PhoneCalls.Hotel.*,
	|	PhoneCalls.PhoneCallService.*,
	|	PhoneCalls.Company.*,
	|	PhoneCalls.PhoneCallPriceIsWithVAT,
	|	PhoneCalls.Unit,
	|	PhoneCalls.VATRate.*,
	|	PhoneCalls.VATSum,
	|	PhoneCalls.Charge.*,
	|	PhoneCalls.PerCallService.*,
	|	PhoneCalls.PerCallServiceVATRate.*,
	|	PhoneCalls.PerCallVATSum,
	|	PhoneCalls.PerCallCharge.*,
	|	PhoneCalls.ExchangeRateDate,
	|	PhoneCalls.Author.*,
	|	PhoneCalls.PointInTime}
	|FROM
	|	AccumulationRegister.PhoneCalls AS PhoneCalls
	|WHERE
	|	(PhoneCalls.Hotel IN HIERARCHY (&qHotel)
	|			OR &qHotelIsEmpty)
	|	AND PhoneCalls.PhoneCallDate >= &qPeriodFrom
	|	AND PhoneCalls.PhoneCallDate < &qPeriodTo
	|	AND (PhoneCalls.PhoneCallType = &qPhoneCallType
	|			OR &qPhoneCallTypeIsEmpty)
	|	AND (PhoneCalls.PhoneNumber IN HIERARCHY (&qPhoneNumber)
	|			OR &qPhoneNumberIsEmpty)
	|	AND (PhoneCalls.Room IN HIERARCHY (&qRoom)
	|			OR &qRoomIsEmpty)
	|{WHERE
	|	PhoneCalls.Period,
	|	PhoneCalls.Recorder.*,
	|	PhoneCalls.PhoneCallDate,
	|	PhoneCalls.PhoneCallType.*,
	|	PhoneCalls.PhoneNumber.*,
	|	PhoneCalls.Room.*,
	|	PhoneCalls.Quantity,
	|	PhoneCalls.Price,
	|	PhoneCalls.Currency.*,
	|	PhoneCalls.Sum,
	|	PhoneCalls.PerCallSum,
	|	PhoneCalls.TargetPhoneNumber,
	|	PhoneCalls.PhoneCallRegion,
	|	PhoneCalls.Remarks,
	|	PhoneCalls.Folio.*,
	|	PhoneCalls.Hotel.*,
	|	PhoneCalls.PhoneCallService.*,
	|	PhoneCalls.Company.*,
	|	PhoneCalls.PhoneCallPriceIsWithVAT,
	|	PhoneCalls.Unit,
	|	PhoneCalls.VATRate.*,
	|	PhoneCalls.VATSum,
	|	PhoneCalls.Charge.*,
	|	PhoneCalls.PerCallService.*,
	|	PhoneCalls.PerCallServiceVATRate.*,
	|	PhoneCalls.PerCallVATSum,
	|	PhoneCalls.PerCallCharge.*,
	|	PhoneCalls.ExchangeRateDate,
	|	PhoneCalls.CurrencyExchangeRate,
	|	PhoneCalls.Author.*,
	|	PhoneCalls.PointInTime}
	|
	|ORDER BY
	|	PhoneCallDate
	|{ORDER BY
	|	Period,
	|	PhoneCalls.Recorder.*,
	|	PhoneCallDate,
	|	PhoneCallType.*,
	|	PhoneNumber.*,
	|	Room.*,
	|	Quantity,
	|	Price,
	|	Currency.*,
	|	Sum,
	|	PerCallSum,
	|	TargetPhoneNumber,
	|	PhoneCallRegion,
	|	Folio.*,
	|	PhoneCalls.Hotel.*,
	|	PhoneCalls.PhoneCallService.*,
	|	PhoneCalls.Company.*,
	|	PhoneCalls.VATRate.*,
	|	PhoneCalls.VATSum,
	|	PhoneCalls.Charge.*,
	|	PhoneCalls.PerCallService.*,
	|	PhoneCalls.PerCallServiceVATRate.*,
	|	PhoneCalls.PerCallVATSum,
	|	PhoneCalls.PerCallCharge.*,
	|	PhoneCalls.ExchangeRateDate,
	|	PhoneCalls.CurrencyExchangeRate,
	|	PhoneCalls.Author.*,
	|	PhoneCalls.PointInTime}
	|TOTALS
	|	SUM(Quantity),
	|	SUM(Sum),
	|	SUM(PerCallSum)
	|BY
	|	OVERALL
	|{TOTALS BY
	|	(HOUR(PhoneCalls.Period)) AS AccountingHour,
	|	(BEGINOFPERIOD(PhoneCalls.Period, DAY)) AS AccountingDate,
	|	(WEEK(PhoneCalls.Period)) AS AccountingWeek,
	|	(MONTH(PhoneCalls.Period)) AS AccountingMonth,
	|	(QUARTER(PhoneCalls.Period)) AS AccountingQuarter,
	|	(YEAR(PhoneCalls.Period)) AS AccountingYear,
	|	(HOUR(PhoneCalls.PhoneCallDate)) AS CallHour,
	|	(BEGINOFPERIOD(PhoneCalls.PhoneCallDate, DAY)) AS CallDate,
	|	(WEEK(PhoneCalls.PhoneCallDate)) AS CallWeek,
	|	(MONTH(PhoneCalls.PhoneCallDate)) AS CallMonth,
	|	(QUARTER(PhoneCalls.PhoneCallDate)) AS CallQuarter,
	|	(YEAR(PhoneCalls.PhoneCallDate)) AS CallYear,
	|	PhoneCallType.*,
	|	PhoneNumber.*,
	|	Room.*,
	|	Currency.*,
	|	TargetPhoneNumber,
	|	PhoneCallRegion,
	|	Folio.*,
	|	PhoneCalls.Hotel.*,
	|	PhoneCalls.PhoneCallService.*,
	|	PhoneCalls.Company.*,
	|	PhoneCalls.PhoneCallPriceIsWithVAT,
	|	PhoneCalls.Unit,
	|	PhoneCalls.VATRate.*,
	|	PhoneCalls.PerCallService.*,
	|	PhoneCalls.PerCallServiceVATRate.*,
	|	PhoneCalls.ExchangeRateDate,
	|	PhoneCalls.Author.*}";
	ReportBuilder.Text = QueryText;
	ReportBuilder.FillSettings();
	
	// Initialize report builder with default query
	vRB = New ReportBuilder(QueryText);
	vRBSettings = vRB.GetSettings(True, True, True, True, True);
	ReportBuilder.SetSettings(vRBSettings, True, True, True, True, True);
	
	// Set default report builder header text
	ReportBuilder.HeaderText = NStr("EN='Phone calls';RU='Телефонные разговоры';de='Telefongespräche'");
	
	// Fill report builder fields presentations from the report template
	cmFillReportAttributesPresentations(ThisObject);
	
	// Reset report builder template
	ReportBuilder.Template = Undefined;
EndProcedure // pmInitializeReportBuilder

// -----------------------------------------------------------------------------
// Reports framework end
// -----------------------------------------------------------------------------
